ajhc/demo-cortex-m3/lpcxpresso-lpc1769/lpc1769/fat_sd/spi_sd_lpc17xx.c
static const DWORD socket_state_mask_cp = (1 << 0);
static const DWORD socket_state_mask_wp = (1 << 1);

static volatile DSTATUS Stat = STA_NOINIT;  /* Disk status */

static BYTE CardType;                       /* Card type flags */

static BYTE socket_powered;
static volatile DWORD Timer1, Timer2;       /* 100Hz decrement timers */

enum speed_setting { INTERFACE_SLOW, INTERFACE_FAST };

/*-----------------------------------------------------------------------*/
/* socket control low-level functions                                    */
/*-----------------------------------------------------------------------*/

static inline uint32_t socket_is_empty(void)
{
	return 0; // not connected on LPC1766-STK -> fake inserted
}

static inline uint32_t socket_is_write_protected(void)
{
	return 0; // not connected on LPC1766-STK -> fake not protected
}

static void socket_power_on()
{
#ifdef SOCKET_POWER_PORT
  GPIO_ClearValue(SOCKET_POWER_PORT, SOCKET_POWER_MASK);
#endif
  socket_powered = 1;
}

static void socket_power_off()
{
#ifdef SOCKET_POWER_PORT
  GPIO_SetValue(SOCKET_POWER_PORT, SOCKET_POWER_MASK);
#endif
  socket_powered = 0;
}

static BYTE socket_is_powered()
{
  return socket_powered;
}


static void socket_init()
{

#ifdef SOCKET_POWER_PORT
  PINSEL_CFG_Type PinCfg;
  // Power P-Channel FET
  PinCfg.Funcnum   = 0;
  PinCfg.OpenDrain = SOCKET_POWER_OPENDRAIN;
  PinCfg.Pinmode   = 0;
  PinCfg.Pinnum    = SOCKET_POWER_PIN;
  PinCfg.Portnum   = SOCKET_POWER_PORT;
  PINSEL_ConfigPin(&PinCfg);
  socket_power_off();
  socket_powered = 0;
  GPIO_SetDir(SOCKET_POWER_PORT, SOCKET_POWER_MASK, 1);
#endif
  
  // card-present switch
  // n/a
  
  // write-protect switch
  // n/a
}


/*-----------------------------------------------------------------------*/
/* SPI low-level functions                                               */
/*-----------------------------------------------------------------------*/
#if ( CARD_SSP == 1 )

static inline void select_card()
{
  GPIO_CLEAR(IO_SD_CS);
}

static inline void de_select_card()
{
  GPIO_SET(IO_SD_CS);
}

static void spi_set_speed( enum speed_setting speed )
{
  if ( speed == INTERFACE_SLOW ) {
    setSSPclock(LPC_SSP1, 400000);
  } else {
    setSSPclock(LPC_SSP1, 25000000);
  }
}

static void spi_init(void)
{
  de_select_card();

  SSP_CFG_Type SSP_ConfigStruct;
  SSP_ConfigStructInit(&SSP_ConfigStruct);
  SSP_Init(LPC_SSP1, &SSP_ConfigStruct);

  CLKPWR_SetPCLKDiv(CLKPWR_PCLKSEL_SSP1, CLKPWR_PCLKSEL_CCLK_DIV_2);

  SSP_Cmd(LPC_SSP1, ENABLE);

  /* wait for busy gone */
  while( LPC_SSP1->SR & SSP_SR_BSY ) { ; }

  /* drain SPI RX FIFO */
  while( LPC_SSP1->SR & SSP_SR_RNE ) {
    volatile uint32_t dummy = LPC_SSP0->DR;
    (void)dummy;
  }

#if ( SPI_SD_ACCESS_MODE == SPI_SD_USE_DMA )
  GPDMA_Init();
  LPC_GPDMA->DMACConfig = 0x01;
#endif
}

void spi_close(void)
{
  SSP_Cmd(LPC_SSP1, DISABLE);
  SSP_DeInit(LPC_SSP1);
}

static inline BYTE spi_rw( BYTE out )
{
	BYTE in;

	LPC_SSP1->DR = out;
	while (LPC_SSP1->SR & SSP_SR_BSY ) { ; }
	in = LPC_SSP1->DR;

	///xprintf("SPIRW O:0x%02x I:0x%02x\n", out, in);

	return in;
}

#define xmit_spi(dat)  spi_rw(dat)

static inline BYTE rcvr_spi(void)
{
	return spi_rw(0xff);
}

/* Alternative macro to receive data fast */
#define rcvr_spi_m(dst)  *(dst)=spi_rw(0xff)


#if ( SPI_SD_ACCESS_MODE == SPI_SD_USE_DMA )

/* reminders:
 * Peripheral Function SSP1_Tx Connection: 2
 * Peripheral Function SSP1_Rx Connection: 3
 */


volatile uint32_t dmacb_rx_tc;
volatile uint32_t dmacb_rx_error;

void DMA_IRQHandler(void)
{
	GPDMA_IntHandler(); // call the default handler
}

void GPDMA_callback_rx(uint32_t DMA_Status)
{
	if( DMA_Status & GPDMA_STAT_INTTC ) {
		dmacb_rx_tc++; // RX DMA terminated
	}
	if ( DMA_Status & GPDMA_STAT_INTERR ) {
		dmacb_rx_error++;
	}
}

static void dma_transfer(
	BYTE dir,          /* MEM_TO_CARD or CARD_TO_MEM                          */
	const BYTE *buff,  /* TO_CARD       : 512 byte data block to be transmitted
	                      FROM_CARD     : Data buffer to store received data    */
	UINT btr           /* TO_CARD       : Byte count (must be multiple of 2)
	                      FROM_CARD     : Byte count (must be 512)              */
)
{
	GPDMA_Channel_CFG_Type GPDMACfg;
	char dummy2[512]; // TODO: get rid of this once DI can be disabled

	if ( dir == MEM_TO_CARD ) {

		GPDMACfg.ChannelNum = DMA_CHANNEL_TX;
		GPDMACfg.SrcMemAddr = (uint32_t)buff;
		GPDMACfg.DstMemAddr = 0;
		GPDMACfg.TransferSize = btr;
		GPDMACfg.TransferWidth = 0;
		GPDMACfg.TransferType = GPDMA_TRANSFERTYPE_M2P;
		GPDMACfg.SrcConn = 0;
		GPDMACfg.DstConn = GPDMA_CONN_SSP1_Tx;
		GPDMACfg.DMALLI = 0;
		GPDMA_Setup( &GPDMACfg, NULL );

		GPDMACfg.ChannelNum = DMA_CHANNEL_RX;
		GPDMACfg.SrcMemAddr = 0;
		GPDMACfg.DstMemAddr = (uint32_t)dummy2; // TODO: get rid of this once DI can be disabled
		GPDMACfg.TransferSize = btr;
		GPDMACfg.TransferWidth = 0;
		GPDMACfg.TransferType = GPDMA_TRANSFERTYPE_P2M;
		GPDMACfg.SrcConn = GPDMA_CONN_SSP1_Rx;
		GPDMACfg.DstConn = 0;
		GPDMACfg.DMALLI = 0;
		GPDMA_Setup( &GPDMACfg, GPDMA_callback_rx );
		// TODO: disable destination increment - does not work yet, terminate interrupt never fires when set
		// DMA_CHANNEL_RX_HANDLE->DMACCControl &= ~GPDMA_DMACCxControl_DI;

	} else {

		GPDMACfg.ChannelNum = DMA_CHANNEL_TX;
		GPDMACfg.SrcMemAddr = (uint32_t)dma_dummy; // TODO: get rid of this once SI can be disabled
		GPDMACfg.DstMemAddr = 0;
		GPDMACfg.TransferSize = btr;
		GPDMACfg.TransferWidth = 0;
		GPDMACfg.TransferType = GPDMA_TRANSFERTYPE_M2P;
		GPDMACfg.SrcConn = 0;
		GPDMACfg.DstConn = GPDMA_CONN_SSP1_Tx;
		GPDMACfg.DMALLI = 0;
		GPDMA_Setup( &GPDMACfg, NULL );
		// TODO: disable source increment - does not work yet, terminate interrupt never fires when set
		// DMA_CHANNEL_TX_HANDLE->DMACCControl &= ~GPDMA_DMACCxControl_SI;

		GPDMACfg.ChannelNum = DMA_CHANNEL_RX;
		GPDMACfg.SrcMemAddr = 0;
		GPDMACfg.DstMemAddr = (uint32_t)buff;
		GPDMACfg.TransferSize = btr;
		GPDMACfg.TransferWidth = 0;
		GPDMACfg.TransferType = GPDMA_TRANSFERTYPE_P2M;
		GPDMACfg.SrcConn = GPDMA_CONN_SSP1_Rx;
		GPDMACfg.DstConn = 0;
		GPDMACfg.DMALLI = 0;
		GPDMA_Setup( &GPDMACfg, GPDMA_callback_rx );

