ajhc/demo-cortex-m3/lpcxpresso-lpc1769/lpc1769/fat_sd/spi_sd_lpc17xx.c
	}

	dmacb_rx_tc = 0;
	dmacb_rx_error = 0;

	GPDMA_ChannelCmd( DMA_CHANNEL_TX, ENABLE );
	GPDMA_ChannelCmd( DMA_CHANNEL_RX, ENABLE );

	NVIC_EnableIRQ( DMA_IRQn );

	SSP_DMACmd( LPC_SSP1, SSP_DMA_RX, ENABLE);
	SSP_DMACmd( LPC_SSP1, SSP_DMA_TX, ENABLE);

	while ( dmacb_rx_tc == 0 ) { ; }

	SSP_DMACmd( LPC_SSP1, SSP_DMA_TX, DISABLE );
	SSP_DMACmd( LPC_SSP1, SSP_DMA_RX, DISABLE );

	NVIC_DisableIRQ( DMA_IRQn );

	GPDMA_ChannelCmd( DMA_CHANNEL_TX, DISABLE );
	GPDMA_ChannelCmd( DMA_CHANNEL_RX, DISABLE );
}

#elif ( SPI_SD_ACCESS_MODE == SPI_SD_USE_FIFO )

#define FIFO_ELEM 8 /* "8 frame FIFOs for both transmit and receive.*/

static inline void spi_rcvr_block (
	BYTE *buff,         /* Data buffer to store received data */
	UINT btr            /* Byte count (must be multiple of 4) */
)
{
	UINT hwtr, startcnt, i, rec;

	hwtr = btr/2;
	if ( btr < FIFO_ELEM ) {
		startcnt = hwtr;
	} else {
		startcnt = FIFO_ELEM;
	}

	LPC_SSP1->CR0 |= SSP_CR0_DSS(16); // DSS to 16 bit

	for ( i = startcnt; i; i-- ) {
		LPC_SSP1->DR = 0xffff;  // fill TX FIFO
	}

	do {
		while ( !(LPC_SSP1->SR & SSP_SR_RNE ) ) {
			// wait for data in RX FIFO (RNE set)
		}
		rec = LPC_SSP1->DR;
		if ( i < ( hwtr - startcnt ) ) {
			LPC_SSP1->DR = 0xffff;
		}
		*buff++ = (BYTE)(rec >> 8);
		*buff++ = (BYTE)(rec);
		i++;
	} while ( i < hwtr );

	LPC_SSP1->CR0 = ( LPC_SSP1->CR0 & ~SSP_CR0_DSS(16) ) | SSP_CR0_DSS(8); // DSS to 8 bit
}

static inline void spi_xmit_block (
	const BYTE *buff    /* 512 byte data block to be transmitted */
)
{
	UINT cnt;
	WORD data;

	LPC_SSP1->CR0 |= SSP_CR0_DSS(16); // DSS to 16 bit

	for ( cnt = 0; cnt < ( 512 / 2 ); cnt++ ) {
		while ( !( LPC_SSP1->SR & SSP_SR_TNF ) ) {
			; // wait for TX FIFO not full (TNF)
		}
		data  = (*buff++) << 8;
		data |= *buff++;
		LPC_SSP1->DR = data;
	}

	while ( LPC_SSP1->SR & SSP_SR_BSY ) {
		// wait for BSY gone
	}
	while ( LPC_SSP1->SR & SSP_SR_RNE ) {
		data = LPC_SSP1->DR; // drain receive FIFO
	}

	LPC_SSP1->CR0 = ( LPC_SSP1->CR0 & ~SSP_CR0_DSS(16) ) | SSP_CR0_DSS(8); // DSS to 8 bit
}

#else
	/* nothing here, polling-mode already integrated in base-functions */
#endif /* SPI_SD_ACCESS_MODE */

#else
#error "port not supported"
#endif /* CARD_SSP */


/*-----------------------------------------------------------------------*/
/* Wait for card ready                                                   */
/*-----------------------------------------------------------------------*/
static BYTE wait_ready (void)
{
	BYTE res;

	Timer2 = 50;	/* Wait for ready in timeout of 500ms */
	rcvr_spi();
	do
		res = rcvr_spi();
	while ((res != 0xFF) && Timer2);

	return res;
}

/*-----------------------------------------------------------------------*/
/* Deselect the card and release SPI bus                                 */
/*-----------------------------------------------------------------------*/
static void release_spi (void)
{
	de_select_card();
	rcvr_spi();
}

/*-----------------------------------------------------------------------*/
/* Power up/down                                                         */
/*-----------------------------------------------------------------------*/
static void power_on()
{
	socket_init();
	socket_power_on();

	delay(250);

	spi_init();
	spi_set_speed(INTERFACE_SLOW);
	de_select_card();
}

static void power_off()
{
	if (!(Stat & STA_NOINIT)) {
		select_card();
		wait_ready();
		release_spi();
	}
	spi_close();
	socket_power_off();
	Stat |= STA_NOINIT;		/* Set STA_NOINIT */
}

/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/
static Bool rcvr_datablock (
	BYTE *buff,			/* Data buffer to store received data */
	UINT btr			/* Byte count (must be multiple of 4) */
)
{
	BYTE token;


	Timer1 = 10;
	do {							/* Wait for data packet in timeout of 100ms */
	  token = rcvr_spi();
	} while ((token == 0xFF) && Timer1);
	if(token != 0xFE) return FALSE;	/* If not valid data token, return with error */

#if ( SPI_SD_ACCESS_MODE == SPI_SD_USE_DMA )
	dma_transfer( CARD_TO_MEM, buff, btr );
#elif ( SPI_SD_ACCESS_MODE == SPI_SD_USE_FIFO )
	spi_rcvr_block( buff, btr );
#else
	do {							/* Receive the data block into buffer */
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
	} while (btr -= 4);
#endif /* SPI_SD_ACCESS_MODE */

	rcvr_spi();						/* Discard CRC */
	rcvr_spi();

	return TRUE;					/* Return with success */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/
#if _FS_READONLY == 0
static Bool xmit_datablock (
	const BYTE *buff,	/* 512 byte data block to be transmitted */
	BYTE token			/* Data/Stop token */
)
{
	BYTE resp;
#if ( SPI_SD_ACCESS_MODE == SPI_SD_USE_POLLING )
	BYTE wc;
#endif

	if (wait_ready() != 0xFF) return FALSE;

	xmit_spi(token);					/* transmit data token */
	if (token != 0xFD) {	/* Is data token */

#if ( SPI_SD_ACCESS_MODE == SPI_SD_USE_DMA )
		dma_transfer( MEM_TO_CARD, buff, 512 );
#elif ( SPI_SD_ACCESS_MODE == SPI_SD_USE_FIFO )
		spi_xmit_block( buff );
#else
		wc = 0;
		do {							/* transmit the 512 byte data block to MMC */
			xmit_spi(*buff++);
			xmit_spi(*buff++);
		} while (--wc);
#endif /* SPI_SD_ACCESS_MODE */

		xmit_spi(0xFF);					/* CRC (Dummy) */
		xmit_spi(0xFF);
		resp = rcvr_spi();				/* Receive data response */
		if ((resp & 0x1F) != 0x05)		/* If not accepted, return with error */
			return FALSE;
	}

	return TRUE;
}
#endif /* _READONLY */

/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/
static BYTE send_cmd (
	BYTE cmd,		/* Command byte */
	DWORD arg		/* Argument */
)
{
	BYTE n, res;


	if (cmd & 0x80) {	/* ACMD<n> is the command sequence of CMD55-CMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready */
	de_select_card();
	select_card();
	if (wait_ready() != 0xFF) {
		return 0xFF;
	}

	/* Send command packet */
	xmit_spi(cmd);						/* Start + Command index */
	xmit_spi((BYTE)(arg >> 24));		/* Argument[31..24] */
	xmit_spi((BYTE)(arg >> 16));		/* Argument[23..16] */
	xmit_spi((BYTE)(arg >> 8));			/* Argument[15..8] */
	xmit_spi((BYTE)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) n = 0x95;			/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) n = 0x87;			/* Valid CRC for CMD8(0x1AA) */
	xmit_spi(n);

	/* Receive command response */
	if (cmd == CMD12) rcvr_spi();		/* Skip a stuff byte when stop reading */

	n = 10;								/* Wait for a valid response in timeout of 10 attempts */
	do
		res = rcvr_spi();
	while ((res & 0x80) && --n);

	return res;			/* Return with the response value */
}

/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/
DSTATUS MMC_disk_initialize(void)
{
	BYTE n, cmd, ty, ocr[4];

	if (Stat & STA_NODISK) return Stat;	/* No card in the socket */

	power_on();							/* Force socket power on and initialize interface */
	spi_set_speed(INTERFACE_SLOW);
	for (n = 10; n; n--) rcvr_spi();	/* 80 dummy clocks with card de-selected */

